Revit 2027 API
AnalysisDisplayDeformedShapeSettings Class
 Contains deformed shape settings for analysis display style element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AnalysisDisplayDeformedShapeSettings : IDisposable
Public Class AnalysisDisplayDeformedShapeSettings
	Implements IDisposable
public ref class AnalysisDisplayDeformedShapeSettings : IDisposable
type AnalysisDisplayDeformedShapeSettings =
    class
        interface IDisposable
    end
The AnalysisDisplayDeformedShapeSettings type exposes the following members.
Constructors
Name | Description
AnalysisDisplayDeformedShapeSettings() |  Constructs a default instance of deformed shape settings.
AnalysisDisplayDeformedShapeSettings(AnalysisDisplayDeformedShapeSettings) |  Constructs a new copy of the input AnalysisDisplayDeformedShapeSettings object.
Top
Properties
Name | Description
GridColor |  Color of grid lines.
GridLineWeight |  Line weight of grid lines.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Rounding |  Increment to which numeric values of analysis results are rounded in deformed shape.
ShowContourLines |  If true, show contour lines in the analysis display.
ShowGridLines |  If true, show grid lines in the analysis display.
TextLabelType |  Type of deformed shape text visualization.
TextTypeId |  Element id of text associated with the settings.
Transparency |  Transparency percentage of deformed shape color fill on surfaces
Top
Methods
Name | Description
Dispose | Releases all resources used by the AnalysisDisplayDeformedShapeSettings
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsEqual |  Compares two deformed shape settings objects.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace